[LANG]
language=Dutch (Nederland)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=SQL-syntaxfout
200002=Bestand bestaat niet
200003=Bestand is beschadigd
200004=Parameterfout
200026=Tabelnaam bestaat al
200027=Tabelnaam bestaat niet
200028=Fout bij importeren CSV-bestand, genereren van SQL mislukt, controleer de inhoud van het CSV-bestand en de configuratie
300001=Geen tabelkolom geselecteerd om index te maken
300002=SQL-instructie mag niet leeg zijn
300003=SQL-analyse ondersteunt alleen SELECT-query's
[STRING]
home=Home
database=Database
analysis=Analyse
view=Weergave
setting=Instellingen
items=records
tables=Tabellen
views=Weergaven
triggers=Triggers
columns=Kolommen
indexes=Indexen
table=Tabel
clear-all=Alles wissen
yes=Ja
no=Nee
welcome-text=Welkom bij CuteSqlite
home-text1=CuteSqlite is een grafische client (GUI) tool voor Sqlite3.
home-text2=Hiermee kunt u databases ontwerpen, maken en doorzoeken, databaseobjecten beheren,
home-text3=gegevens invoegen en SQL-query's ontwerpen en uitvoeren om de opgeslagen gegevens te verwerken.
home-text4=U kunt ook databases en gegevens van andere databaseleveranciers migreren naar een Sqlite-database.
db-section-text=Sqlite-database
analysis-text1=CuteSqlite stelt u in staat de prestaties van SQL-instructies te analyseren en te optimaliseren.
analysis-text2=En het stelt u ook in staat de opslagcapaciteit van elke tabel in de database te analyseren,
analysis-text3=evenals de databaseparameters te configureren om de database te optimaliseren.
perf-analysis-section-text=Prestatieanalyse
error-text=Systeemfout:
create-database=Nieuwe database maken (Ctrl+N)
open-database=Database openen (Ctrl+O)
refresh-database=Database verversen (F5)
delete-database=Geselecteerde database uit lijst verwijderen (Del)
override-user-db=Gegevens van verwijderd bestand kunnen niet worden hersteld. Bevestigen om database te overschrijven?
create-db-success-text=Database succesvol aangemaakt
open-db-exists-inlist=Database is al geopend, herhaal de bewerking niet
open-db-success-text=Database succesvol geopend
delete-user-db=Bevestigen om database "{dbName}" uit lijst te verwijderen?
delete-db-success-text=Database succesvol uit lijst verwijderd
query-editor=Query-editor
history=Geschiedenis
history-tip=Geschiedenis (F8)
result-list=Resultaten
result-info=Informatie
result-table-data=Tabelgegevens
table-properties=Tabeleigenschappen
exec-select-sql=Geselecteerde query uitvoeren (F9)
exec-all-sql=Alle query's uitvoeren (F10)
explain-select-sql=Explain van geselecteerde SQL-instructie (F11)
explain-query-plan-sql=Explain query plan van geselecteerde SQL-instructie (F12)
query-page-help=Automatisch aanvullen functie: [Tab] -> volgend tabblad; [Ctrl+Spatie] -> overeenkomsten tonen; [Ctrl+Enter] -> alle tags tonen
no-select-userdb=Geen database geselecteerd
no-sql-statement=Geen SQL-instructie in query-editor
no-sql-content=Geen SQL-inhoud in query-editor
show-form-view=Formulierweergave tonen
export-result-as=Exporteren als... (Ctrl+Alt+E)
copy-result-data=Gegevens naar klembord kopiëren
clear-all=Alles wissen
ok=OK
cancel=Annuleren
export-text-description=Kies het formaat voor gegevensexport
csv-settings=CSV-opties
csv-field-settings=Kolommen
csv-line-settings=Rijen
csv-charset-settings=Tekenset
excel-settings=Excel-opties
sql-settings=SQL-opties
export-fields-settings=Selecteer de kolommen om te exporteren
terminated-by=Scheidingsteken
enclosed-by=Insluitingsteken
escaped-by=Escapeteken
field-terminated-by=Kolomscheidingsteken
field-enclosed-by=Kolominsluitingsteken
field-escaped-by=Kolomescapeteken
line-terminated-by=Regelscheidingsteken
add-column-name=Kolomnamen toevoegen in koptekst
csv-charset=Tekenset
excel-column-max-size=Limiet voor tekstkolomgrootte
excel-decinmal-places=Decimalen
structure-only=Alleen structuur
data-only=Alleen gegevens
structure-and-data=Structuur en gegevens
select-all=Alles selecteren
deselect-all=Alles deselecteren
save-to-file=Opslaan in bestand
expert-fmt-error=Selecteer het bestandsformaat voor gegevensexport
terminated-by-error=Voer de waarde in voor "Scheidingsteken"
enclosed-by-error=Voer de waarde in voor "Insluitingsteken"
escaped-by-error=Voer de waarde in voor "Escapeteken"
line-terminated-by-error=De waarde van "Regelscheidingsteken" is onjuist
excel-column-max-size-error=Voer de waarde in voor "Limiet voor tekstkolomgrootte"
excel-decinmal-places-error=Voer de waarde in voor "Decimalen"
export-sql-error=Selecteer de SQL-opties
selected-fields-error=Selecteer de kolommen om te exporteren
export-path-error=Voer het pad van het exportbestand in
sql-notsupport-multitable-query-error=Exporteren van resultaten van query's over meerdere tabellen en subquery's wordt niet ondersteund
export-success-text=Exporteren gelukt, {rows} rijen gegevens geëxporteerd. Bestand openen?
open-the-file=Bestand openen
export-file-exists-prompt={export-path} bestaat al. Vervangen?
limit-rows=Rijlimiet
offset=Startrij
rows=Aantal rijen
copy-all-rows-to-clipboard=Alle rijen naar klembord kopiëren Ctrl+Alt+A
copy-sel-rows-to-clipboard=Geselecteerde rijen naar klembord kopiëren Ctrl+Alt+H
copy-all-rows-as-sql=Alle rijen als SQL kopiëren Ctrl+Alt+J
copy-sel-rows-as-sql=Geselecteerde rijen als SQL kopiëren Ctrl+Alt+K
read-only=Alleen-lezen
filter=Filter (Ctrl+Alt+F)
filter-in-use=Filter in gebruik
refresh=Verversen (Ctrl+F5)
refresh-page=Verversen
new-row-tip=Nieuwe rij (Ctrl+Alt+N)
copy-row-tip=Rij kopiëren (Ctrl+Alt+C)
save-tip=Opslaan (Ctrl+Alt+S)
delete-tip=Geselecteerde rij verwijderen (Ctrl+Del)
cancel-tip=Wijzigingen ongedaan maken (Ctrl+Alt+Z)
revert-tip=Herstellen
save=Opslaan
revert=Wijzigingen ongedaan maken
column=Kolomnaam
condition=Conditie
value=Waarde
delete-confirm-text=Bevestigen om geselecteerde rijen te verwijderen?
query=Query
result=Resultaat
affected-rows=Betrokken rijen
exec-time=Uitvoeringstijd
transfer-time=Overdrachtstijd
total-time=Totale tijd
database-create=DB maken Ctrl+N
database-open=DB openen Ctrl+O
database-refresh=DB verversen Ctrl+R
database-delete=DB verwijderen Del
database-copy=DB kopiëren als... Ctrl+P
database-export-as-sql=DB exporteren naar SQL Ctrl+E
database-import-from-sql=SQL importeren in DB Ctrl+I
database-new=Maken
database-new-table=Tabel
database-new-view=Weergave
database-new-trigger=Trigger
export-as-sql-text-description=Geselecteerde databasetabellen/weergaven/triggers exporteren als SQL
select-database=Geselecteerde database
database-objects=Objecten
structure-and-data-settings=Structuur- en gegevensinstellingen
insert-statement-settings=INSERT-instructie-instellingen
tbl-statement-settings=Tabelinstructie-instellingen
retain-column-text=Kolomnamen behouden in "Insert Into"
contain-multi-rows-text=Elke "Insert"-instructie bevat meerdere rijen (VALUES)
retain-table-text=Oude tabel behouden (Create Table If Not Exists ...)
override-table-text=Oude tabel overschrijven (DROP TABLE, dan CREATE TABLE)
import-from-sql-text-description=Batchgewijs uitvoeren van instructies in SQL-bestand.
abort-on-error-text=Stoppen bij fout.
import-file-not-exists=Te importeren SQL-bestand bestaat niet, selecteer opnieuw.
import-path-empty-error=Het pad van het importbestand mag niet leeg zijn.
import=Importeren
export=Exporteren
tbl-name=Tabelnaam
new-table=Tabel maken
new-view=Weergave maken
new-trigger=Trigger maken
database=Database
schema=Schema
table-columns=Kolommen
table-indexes=Indexen
table-foreignkeys=Vreemde sleutels
column-name=Kolomnaam
data-type=Gegevenstype
default=Standaard
check=Controle
index-name=Indexnaam
index-type=Indextype
index-unique=Uniek
partial-clause=Gedeeltelijke clausule
comments=Opmerkingen
to-be-selected=Beschikbare kolommen
selected=Geselecteerd
up=▲
down=▼
no-columns-selected=Geen kolommen geselecteerd, selecteer er een
sql-preview=SQL-voorbeeld
tbl-name-empty=Tabelnaam mag niet leeg zijn
tbl-name-duplicated=Tabelnaam bestaat al
create-table-success-text=Tabel succesvol aangemaakt.
alter-table-success-text=Tabel succesvol gewijzigd.
rename-table-success-text=Tabelnaam succesvol gewijzigd.
delete-column-confirm-text=De geselecteerde kolom wordt gerefereerd door een of meer indexen. Het verwijderen van deze kolom zal ook de bijbehorende indexen wijzigen. Bevestigen om te verwijderen?
delete-index-confirm-text=De geselecteerde index wordt gerefereerd door een of meer kolommen. Het verwijderen van deze index zal ook de bijbehorende kolommen wijzigen. Bevestigen om te verwijderen?
delete-confirm-text=Bevestigen om te verwijderen?
new-view=Weergave maken
new-trigger=Trigger maken
create-a-view-name=Naam van nieuwe weergave
view-name-not-empty=Naam van nieuwe weergave mag niet leeg zijn
view-name-duplicated=Weergavenaam bestaat al
create-a-trigger-name=Triggernaam
trigger-name-not-empty=Triggernaam mag niet leeg zijn
trigger-name-duplicated=Triggernaam bestaat al
execute-sql-success=SQL succesvol uitgevoerd
copy-db-success-text=Database succesvol gekopieerd
table-open=Tabelgegevens openen Alt+O
table-create=Tabel maken Alt+N
table-alter=Tabel wijzigen Alt+A
table-rename=Tabel hernoemen Alt+M
table-truncate=Tabel legen Alt+T
table-drop=Tabel verwijderen Alt+Del
table-copy-as=Tabel kopiëren naar... Alt+P
table-sharding-as=Sharding Alt+G
table-export=Tabel exporteren naar... Alt+E
table-import-sql=Importeren uit SQL-bestand Alt+I
table-import-csv=Importeren uit CSV-bestand Alt+J
table-manage-index=Tabelindexen beheren
table-manage-foreign-key=Vreemde sleutels van tabel beheren
properties=Eigenschappen
primary-key-duplicated=Primaire sleutel is meerdere keren gedefinieerd.
foreignkey-name=Naam vreemde sleutel
referencing-columns=Kolommen van deze tabel
referenced-table=Gerefereerde tabel
referenced-columns=Gerefereerde kolommen
on-update=Bij bijwerken
on-delete=Bij verwijderen
insert-new-column=Nieuwe kolom toevoegen
insert-new-index=Nieuwe index toevoegen
insert-new-foreignkey=Nieuwe vreemde sleutel toevoegen
insert-del-column=Geselecteerde kolom verwijderen
insert-del-index=Geselecteerde index verwijderen
insert-del-foreignkey=Geselecteerde vreemde sleutel verwijderen
select-referenced-table-first=Selecteer eerst de gerefereerde tabel
new-table-name=Nieuwe tabelnaam
table-name-not-empty=Nieuwe tabelnaam mag niet leeg zijn
table-name-duplicated=Nieuwe tabelnaam bestaat al
ai-column-exists=AUTOINCREMENT-kolom bestaat al.
ai-fobidden-multi-pk=AUTOINCREMENT-kolom bestaat al, meerdere primaire sleutelkolommen zijn niet toegestaan.
ai-column-must-integer=AUTOINCREMENT-kolom moet van het type INTEGER zijn.
truncate-table-confirm-text=Na het legen van de tabel kunnen gegevens niet worden hersteld. Bevestigen om te legen?
truncate-table-success-text=Tabelgegevens succesvol geleegd
drop-table-confirm-text=Na het verwijderen van de tabel kunnen gegevens niet worden hersteld. Bevestigen om te verwijderen?
drop-table-success-text=Tabel succesvol verwijderd
copy-table-text-description=Configuratie van kopieerparameters, ondersteunt tabelshards
from-db-name=Bron-DB
from-tbl-name=Brontabel
to-db-name=Doel-DB
to-tbl-name=Doeltabel
table-sharding-setttings=Tabelshards
enable-table-sharding=Tabelshards inschakelen
table-suffix-begin={suffix} Begin geheel getal
table-suffix-end={suffix} Eind geheel getal
advanced-settings=Geavanceerde sharding-opties
enable-copy-data-with-strategy=Strategie inschakelen om gegevens naar shardtabellen te kopiëren
sharding-strategy-express-text=Shardingstrategie-expressie: {n}
preview-sql=SQL-instructievoorbeeld
structure-and-data-settings-unknown=Structuur- en gegevensinstellingen niet geselecteerd
table-suffix-error=Ongeldig sharding geheel getal, voer een correcte waarde in
target-table-name-no-n=De doeltabel moet de tekenreeks "{n}" bevatten.
sharding-strategy-express-empty=De shardingstrategie-expressie mag niet leeg zijn
copy-table-success-text=Tabel succesvol gekopieerd.
start=Starten
complete=Voltooid
express-title=Shardingstrategie-expressie voor tabel
functions=Functies
express-editor-help=Expressie - dubbelklik op een functie of veld om in editor in te voegen
import-from-csv-text-description=Configuratie voor importeren van gegevens uit CSV-bestand
source-csv-file=Pad naar bron-CSV-bestand
target-database=Doeldatabase
target-table=Doeltabel
columns-setttings=Kolommen
csv-data=CSV-gegevens
column-name-on-top=Eerste rij als kolomnamen
line-terminated-by=Regelscheidingsteken
csv-null-as-keyword=null/NULL als SQL-sleutelwoord
encoding=Tekenset
import-success-text=Importeren gelukt
incorrect-sql-statement=Onjuiste SQL-instructie
import-error-text=Importfout
table-manage-columns=Kolommen beheren
table-drop-column=Kolom verwijderen
table-manage-indexes=Indexen beheren
table-drop-index=Index verwijderen
create-view=Nieuwe weergave maken
open-view=Weergave openen
drop-view=Weergave verwijderen
create-trigger=Trigger maken
open-trigger=Trigger openen
drop-trigger=Trigger verwijderen
drop-view-confirm-text=Na het verwijderen van de weergave kan deze niet worden hersteld. Bevestigen om te verwijderen?
drop-view-success-text=Weergave succesvol verwijderd
drop-trigger-confirm-text=Na het verwijderen van de trigger kan deze niet worden hersteld. Bevestigen om te verwijderen?
drop-trigger-success-text=Trigger succesvol verwijderd
sql-templates=SQL-instructiesjablonen
pragma-templates=Pragmas
sql-log=SQL-geschiedenis
clear-all=Alles wissen
use=Gebruiken
explain=Explain
top=Vastzetten
untop=Losmaken
copy=Kopiëren
delete=Verwijderen
today=Vandaag
yestoday=Gisteren
delete-sql-log-confirm-text=Weet u zeker dat u de SQL-geschiedenis wilt verwijderen?
copy-to-clipboard=Gekopieerd naar klembord
save-success-text=Opslaan gelukt
delete-success-text=Verwijderen gelukt
data-has-changed=Gegevens zijn gewijzigd. Weet u zeker dat u de pagina wilt sluiten?
not-save-and-close=Niet opslaan, sluiten
cancel=Sluiten annuleren
table-export-as=Tabel exporteren Alt+E
export-as-sql-success-text=Exporteren gelukt. Bestand openen?
new-query=Nieuw queryvenster (F7)
save-current=Huidige opslaan (Ctrl+S)
save-all=Alles opslaan (Ctrl+Shift+S)
first-page=Eerste pagina
prev-page=Vorige pagina
next-page=Volgende pagina
last-page=Laatste pagina
save-if-data-has-changed=Gegevens zijn gewijzigd. Opslaan voor sluiten?
unsort=Sortering ongedaan maken
tab-close-this=Deze sluiten
tab-close-others=Andere sluiten
tab-close-left=Alle links sluiten
tab-close-right=Alle rechts sluiten
perf-analysis=Prestatieanalyse
perf-analysis-reports=Analyserapporten
store-analysis=Opslaganalyse
db-params=DB-parameters
not-select-sql=Alleen SELECT-instructies worden ondersteund
open-sql-log=SQL-geschiedenis openen voor prestatieanalyse (Ctrl+L)
add-sql-analysis=Voer SQL-instructie in voor prestatieanalyse (Ctrl+I)
sql-log-not-found=SQL-geschiedenis niet gevonden, controleer of deze is verwijderd
original-sql=Oorspronkelijke SQL-instructie
where-clause-analysis=WHERE-clausule-analyse
order-clause-analysis=ORDER-clausule-analyse
covering-index-analysis=Covering index-analyse
table-join-analysis=JOIN-analyse
in-table=Gegevenstabel
where-use-column=WHERE-clausule gebruikt kolommen
order-use-column=ORDER-clausule gebruikt kolommen
covering-index-column=WHERE- en ORDER-clausules gebruiken kolommen
where-use-index=WHERE-clausule gebruikt index
order-use-index=ORDER-clausule gebruikt index
use-covering-index=Gebruikt covering index
create-index-for-performance=Aanbeveling: maak een index voor de volgende kolommen om de queryprestaties te verbeteren
hint-index-for-performance=Tip: index {hintIndexName} dekt al de kolommen: {hintIndexColumns}
create-covering-index-for-performance=Aanbeveling: maak een covering index voor de volgende kolommen om de queryprestaties te verbeteren
create-index-togeger=Index maken (samen)
create-index-individ=Indexen maken (afzonderlijk)
create-covering-index=Covering index maken
explain-query-plan=Explain Query Plan
query-optimizer-pseudocode=De onderstaande pseudocode toont het uitvoeringsproces van de query-optimalisator
cycle-count=Cyclusstatistieken
optimize-cycle-count=Tip: het wijzigen van de JOIN-volgorde van tabellen kan optimaliseren en het aantal cycli verminderen.
general-settings=Algemene instellingen
about=Over
language-setting=Taalinstelling van de interface
change-language-restart-text=Om de taal te wijzigen, moet de software opnieuw worden opgestart.
close-and-restart=Sluiten en opnieuw starten
do-not-restart=Niet opnieuw starten
about-us=Over ons
about-us-description=CuteSqlite is open-sourcesoftware ontwikkeld door auteur Xuehan Qin.
version-info=Versie
version-info-description=CuteSqlite v0.2.2 beta (64-bits)
feedback=Feedback
feedback-description=Als u problemen heeft met de software, of ideeën en suggesties heeft voor deze applicatie, vul dan het onderstaande formulier in om ons feedback te geven.
content-text=Inhoud
license=Apache Licentie Versie 2.0
select-columns-analysis=SELECT-kolomanalyse
select-use-column=De SELECT-instructie gebruikt de volgende kolommen
select-use-column-count=Aantal kolommen
select-use-column-advice=Aanbeveling: de SELECT-instructie selecteert meer dan {maxColumns} kolommen. Het verminderen van het aantal kolommen kan de queryprestaties verbeteren.
select-use-column-tips=Tip: het verminderen van het aantal kolommen kan de queryprestaties verbeteren.
sql-perf-report-prefix=sql-prestatierapport-
store-analysis-prefix=Opslaganalyse:
analysis-sql=SQL-analyse
open-perf-report=Rapport openen Alt+O
drop-perf-report=Rapport verwijderen Alt+Del
drop-perf-report-confirm-text=Bevestigen om rapport te verwijderen?
store-analysis-text=Hiermee kunt u de opslagcapaciteit van de database, tabellen en tabelindexen analyseren
table-store-analysis=Tabel - {tblName}
index-store-analysis=Index - {idxName} - Tabel: {tblName}
db-disk-used-title=Rapport over gebruik schijfruimte, DB-pad: {dbPath}
page-size-text=Paginagrootte (bytes)
page-size-tips=Paginagrootte (bytes)
file-bytes-text=Bestandsgrootte (bytes)
file-bytes-tips=Bestandsgrootte (bytes)
file-pgcnt-text=Aantal pagina's in hele bestand (gemeten)
file-pgcnt-tips=Aantal pagina's in hele bestand (gemeten)
file-pgcnt2-text=Aantal pagina's in hele bestand (berekend)
file-pgcnt2-tips=Aantal pagina's in hele bestand (berekend)
inuse-pgcnt-text=Aantal pagina's dat gegevens opslaat (gebruikt)
inuse-pgcnt-tips=Aantal pagina's dat gegevens opslaat (gebruikt)
free-pgcnt2-text=Aantal pagina's zonder gegevens (per header)
free-pgcnt2-tips=Aantal pagina's zonder gegevens (per header)
free-pgcnt-text=Aantal pagina's zonder gegevens (berekend)
free-pgcnt-tips=Aantal pagina's zonder gegevens (berekend)
av-pgcnt-text=Aantal automatisch geleegde pagina's
av-pgcnt-tips=Aantal automatisch geleegde pagina's
ntable-text=Aantal tabellen in DB
ntable-tips=Aantal tabellen in DB
nindex-text=Aantal indexen
nindex-tips=Aantal indexen
nmanindex-text=Aantal gedefinieerde indexen
nmanindex-tips=Aantal gedefinieerde indexen
nautoindex-text=Aantal impliciete indexen (auto-increment)
nautoindex-tips=Aantal impliciete indexen (auto-increment)
user-payload-text=Bytes aan opgeslagen gebruikerspayload
user-payload-tips=Bytes aan opgeslagen gebruikerspayload
all-tbl-entrycnt-title=Totaal gegevens van alle tabellen (aantal records)
all-tbl-idx-pagecnt-title=Aantal pagina's van alle tabellen en hun indexen
sperate-tbl-idx-pagecnt-title=Pagina's van alle tabellen en indexen afzonderlijk berekend
all-tbl-idx-report-title=Alle tabellen en indexen
total-pages-percent-text=Percentage van totaal aantal DB-pagina's
total-pages-percent-tips=Percentage van totaal aantal DB-pagina's
nentry-text=Hoeveelheid gegevens (aantal records)
nentry-tips=Hoeveelheid gegevens (aantal records)
storage-text=Gebruikte opslagbytes
storage-tips=Gebruikte opslagbytes
compressed-size-text=Gebruikte bytes na compressie
compressed-size-tips=Gebruikte bytes na compressie
payload-text=Payload-bytes
payload-tips=Payload-bytes
total-meta-text=Metadatabytes
total-meta-tips=Metadatabytes
depth-text=B-boomdiepte
depth-tips=B-boomdiepte
avg-payload-text=Gemiddelde payload per record
avg-payload-tips=Gemiddelde payload per record
avg-unused-text=Gemiddeld ongebruikte bytes per record
avg-unused-tips=Gemiddeld ongebruikte bytes per record
avg-meta-text=Gemiddelde metadata per record
avg-meta-tips=Gemiddelde metadata per record
avg-fanout-text=Gemiddelde vertakkingsfactor
avg-fanout-tips=Gemiddelde vertakkingsfactor
gap-cnt-text=Niet-aaneengesloten pagina's
gap-cnt-tips=Niet-aaneengesloten pagina's
mx-payload-text=Maximale payload per record
mx-payload-tips=Maximale payload per record
ovfl-cnt-text=Aantal gebruikte overlooprecords
ovfl-cnt-tips=Aantal gebruikte overlooprecords
int-pages-text=Aantal gebruikte indexpagina's
int-pages-tips=Aantal gebruikte indexpagina's
leaf-pages-text=Aantal gebruikte bladpagina's
leaf-pages-tips=Aantal gebruikte bladpagina's
ovfl-pages-text=Aantal gebruikte overlooppagina's
ovfl-pages-tips=Aantal gebruikte overlooppagina's
total-pages-text=Totaal aantal gebruikte pagina's
total-pages-tips=Totaal aantal gebruikte pagina's
int-unused-text=Ongebruikte bytes op indexpagina's
int-unused-tips=Ongebruikte bytes op indexpagina's
leaf-unused-text=Ongebruikte bytes op bladpagina's
leaf-unused-tips=Ongebruikte bytes op bladpagina's
ovfl-unused-text=Ongebruikte bytes op overlooppagina's
ovfl-unused-tips=Ongebruikte bytes op overlooppagina's
total-unused-text=Ongebruikte bytes op alle pagina's
total-unused-tips=Ongebruikte bytes op alle pagina's
all-table-report-title=Alle tabellen (exclusief indexen)
all-indices-report-title=Alle indexen (exclusief tabellen)
tbl-and-all-idx-report-title=Tabel {tblName} en al haar indexen
tbl-only-report-title=Tabel {tblName} (exclusief indexen)
idx-only-report-title=Alle indexen van tabel {tblName}
tbl-report-title=Tabel {tblName}
idx-report-title=Index {idxName} van tabel {tblName}
props-tbl-only-report-title=Opslaganalyse van tabel {tblName}
props-idx-props-only-report-title=Alle indexen van tabel {tblName}
db-pragma-params=PRAGMA-parameters
db-quick-config-params=Snelle configuratie-opties
select-pragma=PRAGMA
pragma-analysis-limit-tips=Opvragen of wijzigen van de limiet voor analyse-instellingen (ANALYZE). Dit is het geschatte aantal rijen dat het ANALYZE-commando in elke index controleert.
pragma-application-id-tips=Wordt gebruikt om de 32-bits signed big-endian "Application ID" integer op offset 68 in de databaseheader op te vragen of in te stellen.
pragma-auto-vacuum-tips=Opvragen of instellen van de status van automatisch legen (auto-vacuum) in de database.
pragma-automatic-index-tips=Opvragen, inschakelen of uitschakelen van de functie voor automatisch indexeren.
pragma-busy-timeout-tips=Opvragen of wijzigen van de instelling voor time-out bij bezet (busy timeout).
pragma-cache-size-tips=Opvragen of wijzigen van het maximale aantal databaseschijfpagina's dat SQLite aanbeveelt in het geheugen te houden voor elk geopend databasebestand.
pragma-cache-spill-tips=Inschakelen of uitschakelen van de mogelijkheid van het pagineringsprogramma om vuile cachepagina's midden in een transactie naar het databasebestand te schrijven.
pragma-case-sensitive-like-tips=Het standaardgedrag van de LIKE-operator negeert hoofdlettergevoeligheid voor ASCII-tekens. Daarom is standaard 'a' LIKE 'A' waar.
pragma-cell-size-check-tips=Inschakelen of uitschakelen van extra integriteitscontroles bij het lezen van database B-boompagina's van de schijf. Wanneer celgroottecontrole is ingeschakeld, kan databasecorruptie eerder worden gedetecteerd en is de kans kleiner dat deze zich "verspreidt".
pragma-checkpoint-fullfsync-tips=Opvragen of wijzigen van de fullfsync-vlag voor checkpoint-bewerkingen. Als deze vlag is ingesteld, wordt de F_FULLFSYNC-synchronisatiemethode gebruikt tijdens checkpoint-bewerkingen op systemen die F_FULLFSYNC ondersteunen. De standaardwaarde van de CHECKPOINT_FULLFSYNC-vlag is OFF. Alleen Mac OS-X ondersteunt F_FULLFSYNC.
pragma-collation-list-tips=Retourneert een lijst van de voor de huidige databaseverbinding gedefinieerde collatievolgorden.
pragma-compile-options-tips=Retourneert de namen van de compileeropties die zijn gebruikt bij het bouwen van SQLite, één optie per regel.
pragma-count-changes-tips=Opvragen of wijzigen van de vlag voor het tellen van wijzigingen (count changes). Normaal gesproken, wanneer de count-changes-vlag niet is ingesteld, retourneren INSERT-, UPDATE- en DELETE-instructies geen gegevens.
pragma-data-store-directory-tips=Opvragen of wijzigen van de waarde van de globale variabele sqlite3_data_directory, die wordt gebruikt door de Windows-besturingssysteeminterface-backend om de locatie te bepalen van databasebestanden die zijn opgegeven met een relatief pad.
pragma-data-version-tips=Geeft aan dat het databasebestand is gewijzigd. Interactieve programma's die database-inhoud in het geheugen bewaren of op het scherm weergeven, kunnen het PRAGMA data_version-commando gebruiken om te bepalen of ze het geheugen moeten verversen en opnieuw laden of de schermweergave moeten bijwerken.
pragma-default-cache-size-tips=Opvragen of instellen van het aanbevolen maximale aantal schijfcachepagina's dat wordt toegewezen voor elk geopend databasebestand.
pragma-defer-foreign-keys-tips=Draagt op om alle beperkingen van vreemde sleutels uit te stellen tot de commit van de buitenste transactie.
pragma-empty-result-callbacks-tips=Opvragen of wijzigen van de vlag voor terugroepactie bij leeg resultaat.
pragma-encoding-tips=De tekstcodering die door de hoofddatabase wordt gebruikt: 'UTF-8', 'UTF-16le' (little-endian UTF-16) of 'UTF-16be' (big-endian UTF-16).
pragma-foreign-key-check-tips=Controleert de database of tabel op schendingen van beperkingen van vreemde sleutels.
pragma-foreign-keys-tips=Opvragen, inschakelen of uitschakelen van het afdwingen van beperkingen van vreemde sleutels.
pragma-freelist-count-tips=Retourneert het aantal ongebruikte pagina's in het databasebestand.
pragma-full-column-names-tips=Opvragen of wijzigen van de full_column_names-vlag.
pragma-fullfsync-tips=Opvragen of wijzigen van de fullfsync-vlag. Deze vlag bepaalt of de F_FULLFSYNC-synchronisatiemethode wordt gebruikt op systemen die deze ondersteunen. De standaardwaarde van fullfsync is OFF. Alleen Mac OS X ondersteunt F_FULLFSYNC.
pragma-hard-heap-limit-tips=Stelt een limiet in op de hoeveelheid heapgeheugen voor alle databaseverbindingen in één proces.
pragma-ignore-check-constraints-tips=Inschakelen of uitschakelen van het afdwingen van CHECK-beperkingen. De standaardinstelling is OFF, wat betekent dat CHECK-beperkingen standaard worden afgedwongen.
pragma-incremental-vacuum-tips=Zorgt ervoor dat maximaal N pagina's uit de freelist worden verwijderd.
pragma-integrity-check-tips=Voert een laagwaardige opmaak- en consistentiecontrole uit op de database.
pragma-journal-mode-tips=Opvragen of instellen van de journaalmodus (journal mode) voor de database die is gekoppeld aan de huidige verbinding.
pragma-journal-size-limit-tips=Beperkt de grootte van de rollback-journaal- en WAL-bestanden die na een transactie of checkpoint in het bestandssysteem achterblijven.
pragma-legacy-alter-table-tips=Stelt de waarde van de legacy_alter_table-vlag in of vraagt deze op.
pragma-locking-mode-tips=Stelt de vergrendelingsmodus (locking mode) van de databaseverbinding in of vraagt deze op. De modi zijn NORMAL of EXCLUSIVE.
pragma-max-page-count-tips=Opvragen of instellen van het maximale aantal pagina's in het databasebestand.
pragma-mmap-size-tips=Opvragen of wijzigen van het maximale aantal bytes dat is gereserveerd voor geheugen-gemapte I/O (memory-mapped I/O) voor één database.
pragma-module-list-tips=Retourneert een lijst van de bij de databaseverbinding geregistreerde virtuele tabelmodules.
pragma-optimize-tips=Probeert de database te optimaliseren.
pragma-page-count-tips=Retourneert het totale aantal pagina's in het databasebestand.
pragma-page-size-tips=Opvragen of instellen van de paginagrootte van de database. De paginagrootte moet een macht van twee zijn tussen 512 en 65536.
pragma-parser-trace-tips=Schakelt de tracering in van de SQL-parser die intern door SQLite wordt gebruikt. Werkt alleen als gecompileerd met SQLITE_DEBUG.
pragma-query-only-tips=Voorkomt gegevenswijzigingen in het databasebestand. Wanneer deze optie is ingeschakeld, leidt elke poging tot CREATE, UPDATE, DROP, INSERT of UPDATE tot een SQLITE_READONLY-fout.
pragma-quick-check-tips=Voert een laagwaardige opmaak- en consistentiecontrole uit op de database, waarbij de consistentiecontroles voor UNIQUE en indexen worden overgeslagen.
pragma-read-uncommitted-tips=Opvragen, inschakelen of uitschakelen van het isolatieniveau READ UNCOMMITTED.
pragma-recursive-triggers-tips=Opvragen, inschakelen of uitschakelen van de recursieve uitvoering van triggers.
pragma-reverse-unordered-selects-tips=Wanneer deze pragma is ingeschakeld, zorgt dit ervoor dat veel SELECT-query's zonder ORDER BY-clausule de resultaten in een meestal omgekeerde volgorde retourneren.
pragma-schema-version-tips=Haalt de integerwaarde schema_version op offset 40 in de databaseheader op of stelt deze in.
pragma-secure-delete-tips=Opvragen of wijzigen van de instelling voor veilig verwijderen (secure-delete).
pragma-short-column-names-tips=Opvragen of wijzigen van de vlag voor korte kolomnamen.
pragma-soft-heap-limit-tips=Beperkt de hoeveelheid heapgeheugen die wordt gebruikt door alle databaseverbindingen in één proces.
pragma-stats-tips=Retourneert hulp informatie over tabellen en indexen.
pragma-synchronous-tips=Opvragen of wijzigen van de instelling van de "synchronous"-vlag.
pragma-temp-store-tips=Opvragen of wijzigen van de waarde van de globale variabele sqlite3_temp_directory, die door veel backend-interfaces van besturingssystemen wordt gebruikt om de locatie voor tijdelijke tabellen en indexen te bepalen.
pragma-threads-tips=Aantal hulpthreads dat wordt gestart door een voorbereide instructie (prepared statement) om te helpen bij de query.
pragma-trusted-schema-tips=Bepaalt of het uitvoeren van onveilige SQL-functies en virtuele tabellen in het schema is toegestaan. Bepaalt of weergaven, triggers of schema-expressies (zoals CHECK-beperkingen, DEFAULT-clausules, gegenereerde kolommen, expressie-indexen en/of gedeeltelijke indexen) onveilige SQL-functies en virtuele tabellen mogen uitvoeren.
pragma-user-version-tips=Haalt de integerwaarde user_version op offset 60 in de databaseheader op of stelt deze in.
pragma-vdbe-addoptrace-tips=Volledige VDBE-bewerkingscodes worden weergegeven tijdens het genereren van code. Werkt als SQLite is gecompileerd met de SQLITE_DEBUG-optie en vdbe_debug is ingeschakeld.
pragma-vdbe-debug-tips=Schakelt VDBE-foutopsporing in. Werkt als SQLite is gecompileerd met de SQLITE_DEBUG-optie.
pragma-vdbe-listing-tips=Toont een volledige lijst van virtuele machine-bewerkingscodes op de standaarduitvoer. Werkt als SQLite is gecompileerd met de SQLITE_DEBUG-optie en vdbe_debug is ingeschakeld.
pragma-vdbe-trace-tips=Print virtuele machine-bewerkingscodes op de standaarduitvoer tijdens de berekening. Werkt als SQLite is gecompileerd met de SQLITE_DEBUG-optie en vdbe_debug is ingeschakeld.
pragma-wal-autocheckpoint-tips=Opvragen of instellen van het interval voor automatische checkpoints (auto-checkpoint) voor het write-ahead log.
pragma-wal-checkpoint-tips=Zorgt ervoor dat de inhoud van het write-ahead log voor database X in verbinding D wordt overgebracht naar het databasebestand en het write-ahead log wordt gereset.
pragma-writable-schema-tips=Maakt het mogelijk de sqlite_schema-tabel te wijzigen met gewone UPDATE-, INSERT- en DELETE-instructies. Waarschuwing: misbruik van deze pragma kan gemakkelijk leiden tot beschadiging van het databasebestand.
pragma-save-confirm=De PRAGMA-instructie heeft invloed op de werking van de database. Bevestigen om de volgende instructie uit te voeren?
confirm-exec-text=Bevestigen en uitvoeren